Solutions/Artillery/AgencyAPI_File.yml
config:
  target: "https://qa.agencyapi.firstam.net/api/v1.0/file"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 10
      name: Sustained load
scenarios: 
  - name: "Get File"
    flow: 
      - get:
          url: "/2061"
      - think: 5